{
  "name": "Mattia Müggler",
  "about": {
    "title": "About me",
    "text": "Hi, my name is Mattia Müggler. I'm a twenty-one-year-old software engineer and work at Raiffeisen Switzerland. I live with my family in Zuzwil which is near to St. Gallen. In my spare time, I love to do some private coding projects. In this curriculum vitae, I'm going to show you a few details about me. My preferred topics are developing backends with Go, but I'm also able to develop backends with Kotlin/Java. For my frontends, I mostly use Nuxt (Vue) and Angular. I like tech very much, and coding is absolutely my passion. Try out some new technology, tools hook me every time."
  },
  "hobbies": {
    "title": "Hobbies",
    "list": [
      "Snowboarding",
      "Coding some private projects",
      "Doing something with friends"
    ]
  },
  "skills": {
    "title": "Skills",
    "content": [
      {
        "title": "JavaScript / TypeScript",
        "description": "I work every day with TypeScript at work on account of our frontend application is built with Angular. In my spare time, I also often work with TypeScript because I build my private frontends with Nuxt (Vue), which is also TypeScript.",
        "tags": [
          "Tech",
          "Coding",
          "Advanced knowledge"
        ]
      },
      {
        "title": "Go",
        "description": "For more than the last two years (since spring 2022), I’ve been working with Go. I started using Go at work because our backend at this time was written in Go. Similar to this time, I started using Go for my private projects because I really liked it on account of the syntax, performance, easy-to-read, resource management and more.",
        "tags": [
          "Tech",
          "Coding",
          "Advanced knowledge"
        ]
      },
      {
        "title": "Java / Kotlin",
        "description": "In the summer of 2023, we started to rewrite our Go backend in Kotlin on account of having more experienced developers in Kotlin and Java in our company than for Go. For this reason (and some more), we switched to a Spring-Boot Kotlin application. Before this, I worked on my apprenticeship with Java and Spring Boot for more or less a year.",
        "tags": [
          "Tech",
          "Coding",
          "Medium knowledge"
        ]
      },
      {
        "title": "Python",
        "description": "A while ago (3-4 years ago), I was experimenting with machine learning, and for this reason, I worked with Python. At the same time, I wrote some scripts in Python to automate some private tasks.",
        "tags": [
          "Tech",
          "Coding",
          "Base knowledge",
          "Scripting"
        ]
      },
      {
        "title": "PHP",
        "description": "I worked with PHP during my apprenticeship in my spare time because I built some websites and plugins with and for WordPress. A good friend was a huge WordPress fan, so we built our private projects like Bookspread and Möbilo with WordPress and coded some plugins for the custom functionality we wanted. Since WordPress is written in PHP, we also had to write these plugins in PHP. Especially for Bookspread we coded a huge PHP backend for our functionality, so it wasn’t only plugins written in PHP, it was also more PHP itself for this backend.",
        "tags": [
          "Tech",
          "Coding",
          "Medium knowledge"
        ]
      },
      {
        "title": "C / C++",
        "description": "In C and C++, I have not as much experience as in the other coding languages. I worked with these programming languages for about a year at my apprenticeship school. Otherwise, I have not really experienced these languages.",
        "tags": [
          "Tech",
          "Coding",
          "Base knowledge"
        ]
      },
      {
        "title": "C# / .NET",
        "description": "In my apprenticeship school, we had to create a mark management tool as a project in C# with .NET. It was a bigger project where we worked in groups of three students. This tool could manage dynamic classes with students and teachers. As such, we had a dynamic functionality for profession creation. This allows the instance administrator (e.g., headmaster) to define new professions and how this profession is marked, and which mark respectively subject has which weight for the final exam. There was also more functionality in this project, but this description shouldn’t be a description of this project :).",
        "tags": [
          "Tech",
          "Coding",
          "Base knowledge"
        ]
      },
      {
        "title": "OpenShift / Kubernetes",
        "description": "At Raiffeisen Switzerland, we are using OpenShift for the deployment of our applications. I'm working with the team that provides the OpenShift service and is responsible for that. For this reason I have some experience with OpenShift, but more from a developer view on account of publishing our application on OpenShift. For my private projects, I have a fully managed Kubernetes service from DigitalOcean because I want to focus my project on the coding part and not the Kubernetes part, for example, how to add PVCs or other storage classes. Another reason is that I don’t want the pressure to bring the cluster back online if the cluster has a problem. Owing to this reason, I’m using this managed Kubernetes cluster, and I’m happy with this Decision and have the most of my private applications hosted on this cluster.",
        "tags": [
          "Tech",
          "DevOps",
          "Medium knowledge"
        ]
      },
      {
        "title": "ArgoCD",
        "description": "To deploy our application at Raiffeisen Switzerland with our team, we're using ArgoCD. Due to this, I worked with ArgoCD. I set up an ArgoCD test instance to learn a bit more about it, but for private projects, I don’t work with ArgoCD. I would like to do it, but ArgoCD needs too many resources, which would be too expensive on my private cluster.",
        "tags": [
          "Tech",
          "DevOps",
          "Base knowledge"
        ]
      },
      {
        "title": "Helm",
        "description": "I worked with Helm and published some basic application respectively Kubernetes manifests with it. Some of the applications I published I templated by myself with Helm, but it’s not a very deep experience.",
        "tags": [
          "Tech",
          "DevOps",
          "Base knowledge"
        ]
      },
      {
        "title": "Github / Gitlab",
        "description": "For my private projects, I use GitHub as my version control system. I worked with GitLab too, but for my use-cases, I like GitHub more than GitLab. I use git for all my projects, although not every project has a very clean branch system because I work alone on my projects :). At work, we also use GitLab, where the branch system is much cleaner. So I’m able to use git for my work.",
        "tags": [
          "Tech",
          "DevOps",
          "Advanced knowledge"
        ]
      },
      {
        "title": "CI/CD",
        "description": "To build and publish my project, I use GitHub Actions to either build my images and publish them mostly to mostly the GitHub container registry or publish the build to GitHub pages if possible. On account of my history with GitLab and from work, I also know GitLab pipelines, but not as well as GitHub actions. I am able to work with GitHub actions (build, publish, ...).",
        "tags": [
          "Tech",
          "DevOps",
          "Medium knowledge"
        ]
      },
      {
        "title": "Docker",
        "description": "For development, I always work with Docker. I run many tools I need for development in a container, for example, my database, OpenTelemetry and more. For my some private services that I run on a virtual private server (VPS), I use Docker too to deploy and publish these services (behind a VPN, but I want to enhance my security with a zero trust like Tailscale). To publish these services, I worked with Caddy but switched to Traefik to play with a new tool.",
        "tags": [
          "Tech",
          "DevOps",
          "Advanced knowledge"
        ]
      },
      {
        "title": "Angular",
        "description": "I work at work and, in the beginning, also on private projects with Angular. So I have a good understanding of how to work with Angular.",
        "tags": [
          "Tech",
          "Frontend",
          "Framework",
          "Advanced knowledge"
        ]
      },
      {
        "title": "Nuxt (Vue)",
        "description": "For my private projects, I switched from Angular to Vue, and I don’t regret this decision. I really like the structure, simplicity, and lightweightness of Vue. However, don’t get me wrong, I also like to work with Angular, but for the moment, I prefer to work with Vue for my private projects. Due to SEO, routing and many other things, I like to work with Nuxt as my framework because it handles many of these points.",
        "tags": [
          "Tech",
          "Frontend",
          "Framework",
          "Advanced knowledge"
        ]
      },
      {
        "title": "Tailwind",
        "description": "Since I started to work with Tailwind, I've been a fan. I really like to add for every part of a style to add a class to my HTML. Even though, it is sometimes a bit of a pain to have dozens of classes in one element. :)",
        "tags": [
          "Tech",
          "Frontend",
          "Advanced knowledge"
        ]
      },
      {
        "title": "SQL",
        "description": "For many projects I worked on, I used a relational database such as SQL. Mostly with MySQL, but sometimes with MariaDB. Sometimes I worked with plain SQL, and sometimes I used an Object-relational mapping (ORM) framework.",
        "tags": [
          "Tech",
          "Database",
          "Advanced knowledge"
        ]
      },
      {
        "title": "MongoDB",
        "description": "For my latest projects, I used MongoDB to try out this database, and I really enjoyed it. It sometimes seems a bit strange to operate through a non-relational database, though.",
        "tags": [
          "Tech",
          "Database",
          "Medium knowledge"
        ]
      },
      {
        "title": "Redis",
        "description": "I implemented Redis for some private projects as a cache database. I'm able to implement this technology and use this technology, but I don't have deep knowledge of it.",
        "tags": [
          "Tech",
          "Database",
          "Base knowledge"
        ]
      },
      {
        "title": "OIDC (Zitadel)",
        "description": "For all my latest projects, I used an OIDC provider (mostly Zitadel and sometimes Keycloak). I really like to have many security aspects, like 2FA, passkeys and more, in my application without having to implement them by myself. As a SaaS developer, I want a secure solution and user management that works fine. I can redeem a bearer token and add this token as the authorization to the request, and I can verify this token in the backend, which is really nice.",
        "tags": [
          "Tech",
          "Standard",
          "Advanced knowledge"
        ]
      },
      {
        "title": "OAuth 2.0",
        "description": "I worked for authorization with OAuth 2.0 too. In my SaaS project, the user has to grant a few Google Drive scopes that he can upload some files to his own drive. For this feature, I worked with OAuth 2.0 granting.",
        "tags": [
          "Tech",
          "Standard",
          "Medium knowledge"
        ]
      },
      {
        "title": "Tracking (Plausible)",
        "description": "At the moment, I work with Plausible to track my user traffic on my websites. I’m more or less satisfied with Plausible, but I will probably try out PostHog in the future because it has many more features.",
        "tags": [
          "Tech",
          "Tool",
          "Medium knowledge"
        ]
      },
      {
        "title": "Ansible",
        "description": "As I mentioned it before, I have my services, which I host on a VPS. To set up these services, I have a modular Ansible script that covers all my basic needs, and I can easily add a new service and run this script with the new service, which will be added to my infrastructure.",
        "tags": [
          "Tech",
          "Scripting",
          "Medium knowledge"
        ]
      },
      {
        "title": "CMS (wordpress)",
        "description": "For our first projects, like Möbilo and Bookspread we used WordPress as our content management system and web application. For this reason, I have a deeper knowledge of WordPress. However, for my current projects, I’m evaluating headless CMS systems like Hygraph, Contentful and Storyblok because I want a headless system to build my own frontend application.",
        "tags": [
          "Tech",
          "Tool",
          "Medium knowledge"
        ]
      },
      {
        "title": "Notion",
        "description": "Since I first heard about Notion, I've been a big fan. I manage and store almost everything in Notion. I document every tool I’ve been working with in Notion, many articles and more in Notion. Even the tasks for my private projects I track in Notion with a kanban board.",
        "tags": [
          "Tech",
          "Tool",
          "Advanced knowledge"
        ]
      },
      {
        "title": "Technologie I used",
        "description": "S3 for Backups and file storing because it’s easy to implement, is a standard, it is cheap and have many additional features like  presigned URLs.\\nVite was my development server when I started to work with Vue. Since I moved to Nuxt I don’t use Vite directly, but behind Nuxt I’m using Vite.\\nHugo is probably my way to go for documentation and websites, which should be easy to update with much information and don’t need a very complex design.\\nOpenAPI is a very nice way to document my APIs. I generated this specification during the build, imported it into my frontend application, and generated some functions out of this specification.\\nReverse proxy like Traefik or Caddy are the tools I use to encrypt my traffic from my client to my services, which I have hosted on my VPS.",
        "tags": [
          "Tech"
        ]
      },
      {
        "title": "Future Topics",
        "description": "I’m really interested in tech, so I have many other tools, frameworks, and protocols I want to try. Some of these I’m listing here, but consider that I’ve tried a few of them already, but I want to try them more: gRPC, GraphQL, performance, security (zero-trust, certificates), CMS (Hygraph, Contentful, Storyblok), OpenTelementry, Message Queuing (Kafka), machine learning, rust, API-Manangement, git - semantic releasing, search engines\\n\\nI played a bit with GraphQL, but I want to try it on a real service. I’m also really fascinated by performance and how I can make my code performant. My goal is to write good code, but I always have the performance aspect in mind. As I mentioned before, I want to add Tailscale to my own infrastructure as a zero-trust layer. Sometimes I'm really keen on a topic like security, and then I’m experimenting with this technology. For this reason, I created my own certificates to understand how this works. While I was playing with these certificates, I published my public certificate/key on my website so that everyone can download and import them to communicate encrypted with me (or send me a mail because I have a S/MIME certificate for my email). Since I understand how certificates work, I have new ideas for how to use them, e.g., mutual authentication for APIs. Even though I'm not an expert in encryption or certificates, I'm interested in technology. I worked with Kafka, but I want more and deeper knowledge on this topic because it is very interesting. 4 Years ago, in my apprenticeship, I was playing with machine learning in my spare time and did all the typical stuff like sorting clothes or animals. I would like to work on this topic in the future because it is a very interesting subject. Rust seems to be a very absorbing programming language, which I want to try. I also want to try using and play with a search engine like ElasticSearch, Algolia or Typesense.",
        "tags": [
          "Tech"
        ]
      }
    ]
  },
  "awards": {
    "title": "Awards",
    "content": [
      {
        "title": "International youth project competition",
        "description": "With Bookspread, we won the Liechtenstein youth projects competition and thus qualified for the international (St. Gallen - Switzerland, Liechtenstein, Vorarlberg - Austria) youth projects competition, which we also won.",
        "mentions": [
          {
            "title": "Interview Bookspread-Projektgruppe (youtube.com)",
            "url": "https://youtu.be/hQn_qXLESb4?si=Mbt9-akT7etwLeIm"
          },
          {
            "title": "Finale des regionalen Jugendprojekt-Wettbewerbs am Samstag in Triesen (vaterland.li)",
            "url": "https://www.vaterland.li/liechtenstein/kultur/den-passenden-verlag-per-mausklick-finden-art-514137"
          },
          {
            "title": "Interregionaler Jugendprojekt-Wettbewerb: Sieger gekürt (gsi-news.at)",
            "url": "https://www.gsi-news.at/2022/11/27/interregionaler-jugendprojekt-wettbewerb-sieger-gekuert/"
          },
          {
            "title": "Mit kreativen Ideen die Jury begeistert (vaterland.li)",
            "url": "https://www.vaterland.li/liechtenstein/gesellschaft/mit-kreativen-ideen-die-jury-begeistert-art-509587"
          },
          {
            "title": "Youth Project Competition 2022 (backstage.li)",
            "url": "https://backstage.li/liechtenstein-gewinnt-jugendprojekt-wettbewerb-2022/"
          },
          {
            "title": "These are the projects for 2022 (aha.li)",
            "url": "https://www.aha.li/das-sind-die-projekte-2022"
          },
          {
            "title": "Three projects in the final (aha.li)",
            "url": "https://aha.li/die_vorausscheidung"
          }
        ],
        "images": [
          "/images/awards/bookspread/bookspread-team.png",
          "/images/awards/bookspread/bookspread-on-stage.png",
          "/images/awards/bookspread/bookspread-lichtenstein-compitition.png",
          "/images/awards/bookspread/bookspread-won-liechtenstein.png",
          "/images/awards/bookspread/bookspread-won-again.png"
        ]
      },
      {
        "title": "Best \"Individual practice work\" (IPA) from ICT Eastern Switzerland",
        "description": "My final closure project of my apprenticeship was honored as the best project of this year by ICT Eastern Switzerland.",
        "mentions": [
          {
            "title": "LinkedIn Post (linkedin.com)",
            "url": "https://www.linkedin.com/posts/mattia-mueggler_gestern-war-die-qv-feier-meiner-ausbildung-activity-7082417704485179392-Guzi"

          }
        ],
        "images": [
          "/images/awards/ipa/ipa-stage-with-mark.jpg",
          "/images/awards/ipa/ipa-stage-with-moderator.jpg",
          "/images/awards/ipa/ipa-mark-slide.png"
        ]
      }
    ]
  },
  "currentWork": {
    "title": "Work",
    "text": "My team offers a self-service platform where developers are able to create their own projects. One can create OpenShift namespaces, GitLab groups, Artifactory repositories and MySQL or MongoDB databases on it. Further, one could authorize the collaborators from the group to work on different projects and customize existing projects. For example, an OpenShift namespace  could be resized to update the quota. This was developed for the external development environment as well as the internal environment. The backend was solved with Kotlin and a microservice architecture, and the frontend with Angular. This is solved with a Microservice architecture. If one service has to notify the other services, we are using Kafka to send a message, and all services could subscribe these messages."
  },
  "privateProjects": {
    "title": "Private Projects",
    "content": [
      {
        "title": "Notify (In development and planning)",
        "description": "Notify is a simple secure message gateway witch allows you to send messages from your frontend. Connect Slack or Mailgun to send Messages. The advantage is that you do not have to expose an API key in the frontend, as host verification is used. Any number of workflows and message templates can be added in the notify backend. The code is open source and the first version has already been released. In the future it is planned to offer fully managed instances (similar like Plausible). Currently hosted on my private K8s cluster.",
        "imagePath": "/images/notify.jpeg",
        "href": "https://github.com/m-mattia-m/Notify"
      },
      {
        "title": "Formtion (In development and marketing)",
        "description": "Formtion automatically generates a form to match your Notion database. You can also upload files to external providers like Google Drive, OneDrive or Dropbox. The first version is public and already has registered users. However, it is still under active development. Currently hosted on my private K8s cluster.",
        "imagePath": "/images/formtion.png",
        "href": "https://formtion.app"
      },
      {
        "title": "Bookspread (deprecated)",
        "description": "This is a platform for book authors to search and filter for publishers. They can find fitting publishers witch their genres. Further, they can add the publishers to their list and then submit all the required documents directly through the platform. The intelligent submission form checks the requirements of the publishers and sends the right documents to the publisher requesting them. With this platform, we won the Liechtenstein youth projects competition and thus qualified for the interregional (St. Gallen - Switzerland, Liechtenstein, Vorarlberg - Austria) youth projects competition, which we also won. After we spoked with a many publishers, we created a second platform for publishers on which manuscripts are analyzed using artificial intelligence. There were also plans to fundamentally revise the submission process and everything that goes with it as SaaS. However after we considered a low demand to use this tool although we spoked with the publishers we decided to stop working on this project. Partially hosted on my private K8s cluster.",
        "imagePath": "/images/bookspread.png",
        "href": "https://bookspread.io"
      },
      {
        "title": "CRM (in use)",
        "description": "I developed a customer relation management system (CRM) for my mother's partner and customized it to his needs. The goal was to develop a platform where he and his employee can create customers and file rapports based on a customer, so they can see when, what was agreed. For identity management I included Zitadel. Zitadel I hosted on my own server because I like to set it up myself and on the Zitadel-Cloud solutions it was been the free version.",
        "imagePath": "/images/crm.png",
        "href": "#"
      },
      {
        "title": "Möbilo (deprecated)",
        "description": "Before my friends and I developed Bookspread, we started creating Möbilo. We wanted to provide carpenters with an online tool so that their customers could put together a product online. Also a quote would be generated directory. But after talking to several companies, we came to the conclusion that there was no real interest, that the effort would be worthwhile.",
        "imagePath": "/images/moebilo.png",
        "href": "#"
      }
    ]
  },
  "footer": {
    "copyright": "Mattia Müggler"
  }
}